package p0918_01;

public class 수업메모 {
/* 상속 - 클래스 재사용 / 부모자손의 관계가 생김.
오버라이딩(상속일때만 존재)상속받으면서 이름이 동일한 메소드를 재정의하는것
오버로딩 : 클래스 이름이 동일하지만 / 매개변수와 갯수가 다르다.
★다형성 : 조상의참조변수로 자손의 객체를 다루는것!(상속을 해야지만 가능)

추상클래스 : 미완성설계도 /<<추상메소드만>>있어도  <<추상클래스>>  / 다른클래스를 만들때 도움을 줄목적으로 작성. 
[abstract 리턴타입 매서드이름 ();] [{ } : 없음]
인터페이스 : 메소드가 모두다 추상이여야 한다! 차이점 : 추상클래스는 하나만 추상인것
추상메서드와 상수만 가질 수 있다.
인스턴스 생성 할수 없다. 객체선언 불가능
	다중상속이 가능!, Object클래스와 같은 최고조상이 없다 (toString, equals는 안됨)
	상속할때 extends가 아니라 implements로 구현 [class 클래스이름 implements 인터페이스 이름]	
		
	
	
*/	
	
}//
